[
  {
    "Revision": "1.0.7",
    "Changes": "* Testing Version Update for GitHub Deploy\r\n"
  },
  {
    "Revision": "1.0.6",
    "Changes": "* Losing Code signature. \r\n* Disabling Auto Update \r\n* Please see https://github.com/Natestah/BlitzSearch for updated instructions.  \r\n* Direct Change log parsing for version information.\r\n* Installer moved to GitHub Actions\r\n"
  },
  {
    "Revision": "1.0.5",
    "Changes": "* I\u0027m adding Donation Details\r\n* Fixed bug in NOT operator \r\n"
  },
  {
    "Revision": "1.0.4",
    "Changes": "* More highlight fixup with Replace. When replacing simply adjust the matches in the search function.\r\n* Regex Replace now support standard regex substitution ( those $1 $2 )\r\n* Regex Replace highlights now report matches as a diff instead of expression matches.\r\n"
  },
  {
    "Revision": "1.0.3",
    "Changes": "* Removed Case Sensitivity Checkbox on replacing with Blitz Single Word query\r\n* \u0022Word-\u003EBlitz Word\u0022 - Verbage here, I hope guide user a bit.\r\n* Highlighting fixes when doing a replace. \r\n"
  },
  {
    "Revision": "1.0.2",
    "Changes": "* Removed prejudice for large files Types Detection for binaries.  \r\n* Some of Binary Detection happens on discovery now, reducing the need for managing .blitzIgnore and improving memory use on larger projects.\r\n* Improved a thread Lock that happens while initially parsing a large collection of files.\r\n* Control \u002B Mouse Wheel will adjust the font scale.\r\n* Scope selector pops under instead of over.\r\n* Fixed bug in the OR query. \u0022rocket|grenade\u0022\r\n* made \u0022.as\u0022 (angle script) files render as .cpp in search\r\n"
  },
  {
    "Revision": "1.0.1",
    "Changes": "* Improved performance on large folder sets.\r\n* Fixed alignment of Flyout panes throughout.\r\n* Removed File Size Calculation\r\n"
  },
  {
    "Revision": "1.0.0",
    "Changes": "* Fixed S key input on the search box not working. \r\n"
  },
  {
    "Revision": "0.0.99",
    "Changes": "* Fix solution search\r\n"
  },
  {
    "Revision": "0.0.98",
    "Changes": "* Field testing with Unreal Engine source code revealed some major delays, dealing with \u0022cache cleanup\u0022\r\n* Some types that I discovered in source are now mapped (for highlighting) as \u0022.cpp\u0022 and \u0022.h\u0022\r\n"
  },
  {
    "Revision": "0.0.97",
    "Changes": "* Fix for non-existing Global Git ignore file.~~~~\r\n"
  },
  {
    "Revision": "0.0.96",
    "Changes": "* fix for selecting root folder through button\r\n* Special Thanks to Herr Kaste\r\n* https://github.com/Natestah/BlitzSearch/issues/110\r\n* https://github.com/Natestah/BlitzSearch/issues/111\r\n"
  },
  {
    "Revision": "0.0.95",
    "Changes": "* Fix for Ignore files when you are targeting a folder that\u0027s already a system (Hidden) folder.\r\n"
  },
  {
    "Revision": "0.0.94",
    "Changes": "* Ignore Hidden Folders / Files\r\n"
  },
  {
    "Revision": "0.0.93",
    "Changes": "* Fixed an infinite loop hang.\r\n"
  },
  {
    "Revision": "0.0.92",
    "Changes": "* Adding support for Global Git Ignore, this is applied to each root path\r\n* Decoupling option for .blitzIgnore files. Use .blitzIgnore when you want to ignore files that you do not want in .gitIgnore\r\n* Hints in Settings are in Tooltips now, saving vertical space\r\n* Removed Opt-out for Exception Verbosity, You NEED to know when files are locked.\r\n* Fixed Crash that happened when I forced Exception. ( It should show a result node for files that generate exception )\r\n* Restoring Icon in the background, with option to disable it.\r\n* Remove the broken YouTube channel link as well as the link in the Task Bar.\r\n* Removed RoadMap~~~~\r\n* Changing .gitIgnore/.blitzIgnore reflects Immediately\r\n"
  },
  {
    "Revision": "0.0.91",
    "Changes": "* -find parameter takes a path now option too.  \r\n"
  },
  {
    "Revision": "0.0.89",
    "Changes": "* opening the executable with -find, will create a Folder search for the working directory of the -find command.\r\n* Update to the dropdown for folders to show the first folder path.\r\n"
  },
  {
    "Revision": "0.0.88",
    "Changes": "* when opening Visual Studio Solution, Select Visual Studio Editor automatically\r\n"
  },
  {
    "Revision": "0.0.87",
    "Changes": "* Visual Studio Code - Improved multi-Instanced workflow\r\n* Workspace/Solution Scope selectors always Visible, important for knowing where Goto will land.\r\n* Removed Icon Size variable. Generally I\u0027ve found myself adding 10 to the font size. so I\u0027m just removing this setting and doing it automatically.\r\n* Editor Icon Resource size reduction.\r\n* Editor Selection Moved to left. \r\n* Text Labels for scopes Icon only with labels moved to ToolTip.\r\n* When Running \u0022Search This\u0022 from the latest VS Code Extension, VS Code Editor will auto-select for that instance.\r\n"
  },
  {
    "Revision": "0.0.86",
    "Changes": "* Windsurf support\r\n* Visual Studio - Supports multiple Solutions / Instances better ( get the extension update )\r\n* Continued to add more feedback on what\u0027s being searched when you have an empty query.\r\n* Title bar\r\n"
  },
  {
    "Revision": "0.0.85",
    "Changes": "* Moving Visual Studio up in the list / Notepad to the bottom\r\n* Sublime Text Workspace support.\r\n* Sublime Text \u0022Replace this Support\u0022\r\n"
  },
  {
    "Revision": "0.0.84",
    "Changes": "* Fixed Crash ( Backed out .Net 9.0 upgrade for now )\r\n* Various Nuget Jiggling to get back to working state.\r\n"
  },
  {
    "Revision": "0.0.83",
    "Changes": "* Made Workspaces ( vscode style with folders ) different from Solutions. This will help with upcoming Sublime Text work.\r\n* Migrate to .Net 9.0\r\n* All Code Compile Warnings resolved.\r\n* Fixed up some Cache Bleeding, introduced Per Scope caching for these new types.\r\n* Some Security warnings relating to JSON Nugets have been addressed.\r\n"
  },
  {
    "Revision": "0.0.82",
    "Changes": "* Add Cursor Support\r\n"
  },
  {
    "Revision": "0.0.81",
    "Changes": "* VS Code filter fix\r\n"
  },
  {
    "Revision": "0.0.80",
    "Changes": "* Answering many Todo notes\r\n* Removed maximum 10 results from the backend matching.\r\n* Fixed error when leaving a broken Regex, then closing regex search.\r\n* Reorganize preview pane, sits beneath the Search Input box instead of beside it.\r\n* VS Code uses Solution / Folder scope instead of creating a new Folder scope\r\n* Active Files / Current file scopes added.  \r\n* Fixed a cache pollution issue that would create results for files that don\u0027t exist in the folder scope. \r\n"
  },
  {
    "Revision": "0.0.79",
    "Changes": "* Fixed Selected Editor not retaining between sessions\r\n* In Folder Scope selection, I noticed the large image overlaying some buttons and fixed.\r\n* Answered to Security Concern voice in Nuget for MessagePack ( upgraded it )\r\n* Removing Large BlitzLogo/Customized logo from the results pane, because that information is in the combo box dropdown\r\n* Fix Replace/Special chars https://github.com/Natestah/BlitzSearch/issues/83\r\n* Fix Preview Mode being an actual run-mode on non - preview mode supporting editors.\r\n* Adding New GotoEditor Selector right in this new pane.  This affects the Scope visibility and things. \r\n"
  },
  {
    "Revision": "0.0.78",
    "Changes": "* Always switch to the project last loaded by VS Code.  Time will tell if we need an opt out of this behavior but it seem right.\r\n* Only do preview request to VS Code when the internal preview is closed.\r\n"
  },
  {
    "Revision": "0.0.77",
    "Changes": "* VS Code can now Configure the theme in Blitz Search to match automatically. Look for \u0022Blitz Configure Theme\u0022 in the command pallete.\r\n* VS Code now Informs Blitz search about Workspace changes, folders from these workspaces create and select the scope automatically on first discovery.\r\n* Adding a small label to show the selected items Title ( Default VS Code icon here was being too generic ). \r\n"
  },
  {
    "Revision": "0.0.76",
    "Changes": "* Fix highlighting on light theme\r\n"
  },
  {
    "Revision": "0.0.75",
    "Changes": "* Minor Visual Studio update.\r\n"
  },
  {
    "Revision": "0.0.74",
    "Changes": "* Fixed up Goto Editor Selection, important as I change parameters on the built-in\u0027s\r\n* Selection of Editors now persists\r\n* Add Ability to Duplicate BuiltIn readonly editors and modify. These also persist between sessions\r\n* VSCode Previewing, With VS Code selected.\r\n"
  },
  {
    "Revision": "0.0.73",
    "Changes": "* Added Ability to import Themes from JSON\r\n"
  },
  {
    "Revision": "0.0.72",
    "Changes": "* Removing Premium checks, Blitz Search Is fully free\r\n* Small banner has been added, subject to some more change. I ask that you click this and watch and engage. Help me get the word out..\r\n* I am checkpointing my work on the built-in text editor. There is a new file tab, with preview mode. More on this later. \r\n"
  },
  {
    "Revision": "0.0.70",
    "Changes": "* Ignore .TMP files ( for Visual Studio )\r\n"
  },
  {
    "Revision": "0.0.69",
    "Changes": "* Update to handle Replace This Command from VSCode\r\n"
  },
  {
    "Revision": "0.0.68",
    "Changes": "* Changing .gitIgnore setting on Scope settings now updates the results. \r\n"
  },
  {
    "Revision": "0.0.67",
    "Changes": "* Global Case sensitivity selection is removed, read on!\r\n* FileName search is always case-insensitive since windows filesystem is insensitive\r\n* Added ^ operator to query to get per word granularity on Case sensitivity\r\n* Special operators can be Combined now (For whole word Case sensitive use: @^word )\r\n* Special operators can be post-fixed now too. word@ is same as @word.  Since you might decide to append these after you\u0027ve typed and seen the results need continued filtering.\r\n* Humanized number of files, ( 10.3K instead of 10300 )\r\n* Work to Improve responsiveness of Results when nothing is found for a time ( the old results clear out ).  Blitz search keeps old results for a time in order to prevent flickering.\r\n* more immediate response to broken Regular expressions in Regex Search\r\n* [YouTube - Case sensitivity demo](https://youtu.be/2TElEqcqpRk)\r\n"
  },
  {
    "Revision": "0.0.66",
    "Changes": "* Revamped Highlights, handles overlaps better.\r\n* This paves way for more robust painting of highlights for future changes but also fixes the immediate problems in regex Literal replace.\r\n"
  },
  {
    "Revision": "0.0.65",
    "Changes": "* Fixed \u0022Updated\u0022 results not updating correctly.\r\n* Fixed up some Drawing issues with Various Find/Replace operations.\r\n"
  },
  {
    "Revision": "0.0.64",
    "Changes": "* Fixed Links to IDE setup in readme area.\r\n* Added selector box for Literal/Regular expression on Find/Replace\r\n* Some work to Highlighter to better support mismatch in lengths with replacements. \r\n"
  },
  {
    "Revision": "0.0.63",
    "Changes": "* Removed weird inline Left/Right Arrows in favor of \u0022Space Bar\u0022 to toggle the text preview. This is clued by the right click menu and also paves way for folding results. \r\n* Add Toggle for Status bar in the Theme settings.\r\n* Git ignore setting is moved from Settings to Per Scope setting.\r\n* Decrease Hover time from 0.5 to 0.0 for ScrollBars\r\n* Reduced Verbiage in Scope Settings.\r\n"
  },
  {
    "Revision": "0.0.62",
    "Changes": "* Add Handler for Regular Expression Error in .gitIgnore.\r\n"
  },
  {
    "Revision": "0.0.61",
    "Changes": "* Fix RegexEx ShortCut Hint.\r\n* Fixed bug in results in Literal search after an invalid normal search.\r\n* Cleanup Goto Settings, squished selection, etc.~~~~\r\n* Documentation work\r\n* Fixed crash when clicking about on the very front page ( yikes )\r\n* Some word-reduction on Settings page\r\n"
  },
  {
    "Revision": "0.0.60",
    "Changes": "* Blitz Search Premium sales is now live, check website for early bird special!\r\n* [issues/54](https://github.com/Natestah/BlitzSearch/issues/54) Fix negative margins on maximized window at startup.\r\n"
  },
  {
    "Revision": "0.0.59",
    "Changes": "* Little Cleanup to Title Bar Behaviors. Window will shrink a bit better.\r\n* Add Margins for Fullscreen mode to fix things going offscreen\r\n* Margin to Settings window\r\n* Keyboard Down arrow from search box will goto the first result line, then filename if no results in files.\r\n* Keyboard Enter from search will Go directly to the first item in the list.\r\n* Goto Has expander for Customize, also a scroll viewer for vertically challenged windows.\r\n* Goto Editors have more Notes applied, all the Jetbrains products have plugins, etc.\r\n* Goto Editor has a drop down Duplicate to better represent what things are doing.\r\n* Fixed an unhandled exception I found while mucking with Goto Editor settings.\r\n"
  },
  {
    "Revision": "0.0.58",
    "Changes": "* Fixed up filename matching with Literal and Regex Searches\r\n* Fixed results recycling up after adding new features of literal and regex.\r\n* Update Roadmap to reflect addition of Regex feature\r\n"
  },
  {
    "Revision": "0.0.57",
    "Changes": "* Enable Regular Expression search\r\n* More work to messaging when failed expressions happen.\r\n* Fix Last Scope Selection being off when restarting Blitz\r\n"
  },
  {
    "Revision": "0.0.56",
    "Changes": "* Some work internally for Regex ( nothing to show yet )\r\n* Improved crash handling on deployed Blitz Search.  Now shows HTML page for more systemic unhandled Exceptions ( so that I can go after stability )\r\n"
  },
  {
    "Revision": "0.0.55",
    "Changes": "* Fixed Crash that happened as I was demonstrating updates on file changes.\r\n* Two places where I read the file immediately were contending with no recourse/failure handling.\r\n* This is extra important for VS Code users as that tends to hold onto files for various reasons ( LSP and other extensions might hold the file )\r\n* [Premium] Adjustable icon scale, for me to take Zooming out of my social Media post. Less post processing makes video\u0027s a little more crisp\r\n"
  },
  {
    "Revision": "0.0.54",
    "Changes": "* Fix a bug that I noticed today about Updating Results as files are changed.\r\n"
  },
  {
    "Revision": "0.0.53",
    "Changes": "* [issues/49](https://github.com/Natestah/BlitzSearch/issues/49) - Smart case works with Literal Search.\r\n* Smart Case Close button makes adjustment to Literal Search. \r\n* Ignore Case sensitivity when searching the filenames0\r\n"
  },
  {
    "Revision": "0.0.52",
    "Changes": "* [Premium] Adding Literal search option. \r\n* Fix bug in file changes while Blitz is not running. Needed an extra bit of validation.\r\n* Fix some bugs in Replace History.\r\n"
  },
  {
    "Revision": "0.0.51",
    "Changes": "* [Premium] Adding Quick Scope feature\r\n* Minor fix to Selection Vertical Height causing jitter to view\r\n"
  },
  {
    "Revision": "0.0.50",
    "Changes": "* clean install fix exceptions.\r\n"
  },
  {
    "Revision": "0.0.49",
    "Changes": "* Inno Installer upgrade in hopes of thwarting false positive on Windows Defender virus detection.\r\n* Updates for Right arrow in search results pulling out Preview\r\n* Collapsable title menu ( more work needed here, but wanted for vertical social recordings )\r\n* Some initial refactoring work on \u0022Quick Scoping\u0022.  Should come online soon. Nothing feature wise.\r\n"
  },
  {
    "Revision": "0.0.48",
    "Changes": "* [Premium] Find-Replace \r\n* Added RoadMap To Documentation\r\n* Move Right Pane Tabs up to title bar.\r\n"
  },
  {
    "Revision": "0.0.47",
    "Changes": "* More reduced memory usage.\r\n"
  },
  {
    "Revision": "0.0.46",
    "Changes": "* Update Goto for Jetbrains products to also look in LOCALAPPDATA for executables. noticed when I finally updated to 2024 bins.\r\n"
  },
  {
    "Revision": "0.0.45",
    "Changes": "* Results speed increase.. my 4.1 GB text folder went from ~400MS to last result found to \u003C200MS ( sans recycling ) \r\n* This is achieved by re-ordering word storage so that we work on the same pool of words.\r\n* Some efforts towards fixing up Results Recycling sometimes getting a bad set. Evasive due to high frequency of moving parts.\r\n"
  },
  {
    "Revision": "0.0.44",
    "Changes": "* Fix default font.. not everyone has \u0022Cascadia Code\u0022\r\n"
  },
  {
    "Revision": "0.0.43",
    "Changes": "* Visuals improvements, PNG-\u003ESVG for better fidelity \r\n* Custom Title bar allows Theme color to affect space better ( and rendering SVG icon )\r\n* **BugFix:** Launch Registration Application from Program Files instead of \u0022CurrentDirectory\u0022 to assure it lands correctly.\r\n* Theoretical fix on right click crash on results view.\r\n* Work on Folder selection, adding History and AutoCompleteBox.\r\n"
  },
  {
    "Revision": "0.0.42",
    "Changes": "* **BugFix:**: color fix on \u0027:\u0027 for filename path\r\n* [issues/47](https://github.com/Natestah/BlitzSearch/issues/47) Ordering on priority extensions getting mixed up on Recycle results.\r\n* Ignore files ending with ~ ( backup files )\r\n"
  },
  {
    "Revision": "0.0.41",
    "Changes": "* Fix command line preview not showing in Goto Selection\r\n* Fixed up default for Fleet Goto behavior. \r\n"
  },
  {
    "Revision": "0.0.40",
    "Changes": "* Fixed Visual Studio missing from right click to goto\r\n"
  },
  {
    "Revision": "0.0.39",
    "Changes": "* Public Facing Version update feature. Some live tests were required\r\n"
  },
  {
    "Revision": "0.0.38",
    "Changes": "* Testing..\r\n"
  },
  {
    "Revision": "0.0.36",
    "Changes": "* Updater, fetches information about updates and automatically downloads / presents a button about it.\r\n* Clicking update runs installer in Super Silent mode.  It should be quick and painless to install. \r\n* Removed pdb\u0027s from deploy for big Installer size saving.\r\n* Installer is now signed by Natestah LLC.. Meaning Windows Defender won\u0027t bother you with a scary prompt.\r\n* My update process is a little bit more Automated\r\n"
  },
  {
    "Revision": "0.0.35",
    "Changes": "* Fixed changed file when search box has nothing resulting in results.\r\n* Cleanup status bar a bit. ( smaller, less verbiage)\r\n* Add sublime text to IDE setup instructions.\r\n* Fix F8 ( search this from preview ) Now Focuses and highlights text in search box ( like the editors do ) \r\n* [Issue 46](https://github.com/Natestah/BlitzSearch/issues/46) With an empty search field, changed files were creating bogus results\r\n* [Issue 7](https://github.com/Natestah/BlitzSearch/issues/7) Add an option to show total file time (instead of forcing it)\r\n"
  },
  {
    "Revision": "0.0.34",
    "Changes": "* **Premium:** Theme Panel upgrade, Select Syntax Highlighting mode from more that just light/dark radio buttons\r\n* **Premium:** Some Control over Results Spacing\r\n* **Premium:** Global Font Selector.\r\n* Right Click on a word in the preview to \u0022Search on Github\u0022 simply tells web browser to open that up as a github search.\r\n"
  },
  {
    "Revision": "0.0.33",
    "Changes": "* another cache fix as I realized that GetHashCode is indeterminate,  Due to recent improvements to Directory Enumerations this flew under the radar.\r\n"
  },
  {
    "Revision": "0.0.32",
    "Changes": "* Fixed old results coming in when changing the scope, now unique caches are created foreach combination of directories.\r\n* Send the results immediately after quiet time has elapsed. \r\n* More Accurate time on \u0022Last result found\u0022 when recycling is enabled. Was Conflict with \u0022quiet time\u0022 logic. \r\n### 0.0.31\r\n* Fix Whole word considering underscore as a boundary.\r\n* Adding \u0022IDE Setup\u0022 with links to Setup instructions for each.\r\n"
  },
  {
    "Revision": "0.0.30",
    "Changes": "* Add Usage section to Help page\r\n* Fix Reddit link\r\n* Shrank some help images\r\n* Some notes about What Blitz Search Is Not ( AI Driven, Fuzzy Search )\r\n* Added Catch around some new file Discovery \r\n"
  },
  {
    "Revision": "0.0.29",
    "Changes": "* Added parallel to directory enumeration\r\n"
  },
  {
    "Revision": "0.0.28",
    "Changes": "* **BugFix:** - preview pane now updates when files are saved.\r\n* Added Context Menu to Preview Pane with 2 new Hotkey bound commands\r\n  * Goto Selected Editor ( F12 )\r\n  * Search This ( F8 )\r\n"
  },
  {
    "Revision": "0.0.27",
    "Changes": "* Fix highlighting in preview when starting up. A mix up between \u0022Dark\u0022 and \u0022DarkPlus\u0022 (preferred) was flying under the radar.\r\n* Work on Cache Recall, Before the cached recall was only benefiting the first of extension in the list. \r\n"
  },
  {
    "Revision": "0.0.26",
    "Changes": "* Added Change Log and improve help section, Can now show images and things\r\n* [Github #32](https://github.com/Natestah/BlitzSearch/issues/31) Memory improvement for caches\r\n  * Removing common Hexadecimal words\r\n  * underscores removed from remembered names\r\n* [Github #36](https://github.com/Natestah/BlitzSearch/issues/36) Control-F for find-in-files is now Control-Shift-F, so as not to conflict with the Preview panes Control-F\r\n* [Github #38](https://github.com/Natestah/BlitzSearch/issues/38) Fix FileName being recalled, but not shown, creating very misleading non-results.\r\n* Added History Fly-out-drop-downs for file and search fields.\r\n"
  },
  {
    "Revision": "0.0.25",
    "Changes": "* [Github #35](https://github.com/Natestah/BlitzSearch/issues/35) Added Case Sensitivity  \r\n* [Github #35](https://github.com/Natestah/BlitzSearch/issues/35) Smart Case Option ( Any Upper case character indicates case sensitive )\r\n* [Github #35](https://github.com/Natestah/BlitzSearch/issues/35) bumped Avalonia to Beta 11.1.0.beta2 for a change ( radio buttons on menus )\r\n"
  },
  {
    "Revision": "0.0.24",
    "Changes": "* Added all Jetbrains IDE\u0027s to the Goto box\r\n* Shrank the Items since there are many now! \r\n"
  },
  {
    "Revision": "0.0.23",
    "Changes": "* New feature to Update Results when files change\r\n"
  },
  {
    "Revision": "0.0.22",
    "Changes": "* Added granular parsing on .gitIgnore.. Instead of failing the whole thing, fail and log the line.\r\n"
  },
  {
    "Revision": "0.0.21",
    "Changes": "* Fixed an issue that popped up in v20.\r\n"
  },
  {
    "Revision": "0.0.20",
    "Changes": "* Right click Open in Explorer Option\r\n* Right click Open with Command Prompt option\r\n* Minor work to \u0022files not found\u0022 UI in results field.\r\n* **Bugfix:** Fixed inconsistency of report on number of files with Results Recycling.\r\n* **Bugfix:**Much Work to improve behavior of changed files and .blitzIgnore .gitignore files when files change.\r\n* Fixed Icons not showing up in published Exe ( NativeAOC related ).\r\n"
  },
  {
    "Revision": "0.0.19",
    "Changes": "* Added Special thanks ***Carlos Pineda*** for feedback\r\n* Quality of life changes: Right Click menu in the search results to open editor other than what you have selected.\r\n* Close Button on File Name Filter\r\n* **.blitzIgnore** (file) acts like **.gitIgnore**.. For when you want to ignore in blitz, but not GIt. ( I\u0027m still trying to find the context for this )\r\n"
  },
  {
    "Revision": "0.0.18",
    "Changes": "* Blitz now has an adjustable robot file detection that can help identify and save memory Or simply sort those to the end of the search list for quicker Human results.\r\n* The detection is simply \u0022Greater than X MB\u0022 or \u0022First Line Longer than X characters\u0022. both of which are adjustable\r\n* Added Cache Clean up button.\r\n* Additional work when making adjustments to the Scope to weed out old caches and get back some memory.\r\n"
  },
  {
    "Revision": "0.0.17",
    "Changes": "* Work to Restore window state when invoked from outside (make window come to front).\r\n"
  },
  {
    "Revision": "0.0.15",
    "Changes": "* Stuff for Visual Studio Extension ( which is live now in Preview )\r\n"
  },
  {
    "Revision": "0.0.14",
    "Changes": "* Option to show in taskbar.\r\n"
  },
  {
    "Revision": "0.0.13",
    "Changes": "* Minor light theme fixes\r\n* visual studio code plugin update (v6) to run needs this in Blitz too.  Running the command will now launch blitz And Update the search field accordingly.\r\n"
  },
  {
    "Revision": "0.0.12",
    "Changes": "* Dark/Light Theme.\r\n* Fix an out of memory issue.\r\n* Remember the split pane setting on closing.\r\n"
  },
  {
    "Revision": "0.0.11",
    "Changes": "* Integrates Licence management.   ( I haven\u0027t activated the storefront as there is nothing to sell yet ).\r\n* Adding TimeToLastResult / Total Time.\r\n* Removed option to not retain filenames. It was a heavily ignored and suboptimal code path.\r\n* Describe the \u0022Debug Filename\u0022 option better.\r\n* Little bit of work to [ALL files] with priorities.\r\n"
  },
  {
    "Revision": "0.0.9",
    "Changes": "* Project Rider Goto\r\n"
  }
]